mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
float anemometroGetCoordTime(mux_transSelect_enum coordTime) {
    float timeMed = 999.99;
    uint32_t ulNotificationValue;
    BaseType_t notifyStatus = pdFAIL;

    RB_9_SET(0);

    if (muxOutputSelect(coordTime) != pdTRUE) {
        return timeMed;
    }

    DELAY_50uS;

    //    RB_9_SET(1);

    timerStart();

    comparadorPulseTrain_NObloq(TRAIN_PULSE_LENGTH);

    //Necesitaria esperar 400us
    DELAY_400uS;
    //    DELAY_T;
    anemometroReceptorDelay(coordTime);

    timerStop();

    adc_start();

    //    RB_9_SET(0);

    notifyStatus = xTaskNotifyWait(0, UINT32_MAX, &ulNotificationValue, 2 / portTICK_PERIOD_MS);

    adc_stop();

    //    RB_9_SET(0);

    if ((ulNotificationValue & 0x01) != 0 && notifyStatus == pdPASS) {
        /*Detecto Segundo maximo*/
        timeMed = dma_detectPulse(coordTime);
    } else {
        timeMed = 888.88;
    }

    switch (coordTime) {
        case TRANS_EMISOR_OESTE:
            timeMed += (((float) timerCount() / configCPU_CLOCK_HZ));
            break;
        case TRANS_EMISOR_ESTE:
            timeMed += (((float) timerCount() / configCPU_CLOCK_HZ));
            break;
        case TRANS_EMISOR_NORTE:
            timeMed += (((float) timerCount() / configCPU_CLOCK_HZ));
            break;
        case TRANS_EMISOR_SUR:
            timeMed += (((float) timerCount() / configCPU_CLOCK_HZ));

            break;
        default: timeMed = 777.77;
    }

    //    RB_9_SET(0);

    return timeMed;
}

wind_medicion_type anemometroGetMed(void) {
    wind_medicion_type valMed = {0, 0};
    float VcoordOE = 0;
    float VcoordNS = 0;

    //Mido en la coordenada O-E
    VcoordOE = anemometroGetMedProm(TRANS_EMISOR_OESTE, N_MED_PROM);
    //Mido en la coordenada N-S
    VcoordNS = anemometroGetMedProm(TRANS_EMISOR_NORTE, N_MED_PROM);

    //Calculo 
    //    valMed.mag = sqrtf(powf(VcoordOE, 2) + powf(VcoordNS, 2
    if (VcoordOE < 555 && VcoordNS < 555) {
        valMed.mag = sqrtf(VcoordOE * VcoordOE + VcoordNS * VcoordNS);

        if (valMed.mag == 0) {
            valMed.deg = 0;
            return valMed;
        }

        if (VcoordNS != 0) {
            if (VcoordOE > 0 && VcoordNS > 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS);
            }
            if (VcoordNS < 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS) + 180;
            }
            if (VcoordOE < 0 && VcoordNS > 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS) + 360;
            }
        } else if (VcoordOE > 0) {
            valMed.deg = 90;
        } else {
            valMed.deg = 270;
        }
    } else {
        valMed.mag = 999.99;
        valMed.deg = 999.99;
        return valMed;
    }

    return valMed;
}

//void anemometroTdetect(BaseType_t * pxHigherPriorityTaskWoken) {
//    xSemaphoreGiveFromISR(xSemaphoreTrenDetectado, pxHigherPriorityTaskWoken);
//}

void anemometroTdetected(BaseType_t * pxHigherPriorityTaskWoken, uint32_t val) {
    //    vTaskNotifyGiveFromISR(xTaskToNotify, pxHigherPriorityTaskWoken);

    xTaskNotifyFromISR(xTaskToNotify, val, eSetBits, pxHigherPriorityTaskWoken);
}

void anemometroEmiterSelect(mux_transSelect_enum transd) {

    muxOutputSelect(transd);

    //    adc_transdSelect(transd);
}

void anemometroReceptorDelay(mux_transSelect_enum emisor) {
    switch (emisor) {
        case TRANS_EMISOR_OESTE:
            DELAY_O;
            break;
        case TRANS_EMISOR_ESTE:
            DELAY_E;
            break;
        case TRANS_EMISOR_NORTE:
            DELAY_N;
            break;
        case TRANS_EMISOR_SUR:
            DELAY_S;

            break;
        default: DELAY_N;
    }
}

/*Configura los pines de salida del PORTA: RA1 = A y RA0 = B*/
BaseType_t muxOutputSelect(mux_transSelect_enum ch) {
    switch (ch) {
        case TRANS_EMISOR_OESTE:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
        case TRANS_EMISOR_ESTE:
            MUX_INPUT_A(1);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
        case TRANS_EMISOR_NORTE:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(1);
            break;
        case TRANS_EMISOR_SUR:
            MUX_INPUT_A(1);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(1);
            break;
        default:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
    }
    DELAY_50uS;
    //    vTaskDelay(20 / portTICK_PERIOD_MS);

    return pdTRUE;
}

float anemometroCalcMode(float * pData, uint16_t nData) {
    //    float mode[N_TIMER_MODE];
    float c [N_TIMER_MODE];
    uint8_t i, j;

    for (i = 0; i < nData; i++) {
        c [ i ] = 0;
    }

    for (i = 0; i < nData; i++) {
        for (j = 0; j < nData; j++) {
            if ((*(pData + i) == *(pData + j)) && (i != j) && (*(pData + i) != 0)) {
                c [ i ] += 1;
                *(pData + j) = 0;
            }
        }
    }

    i = 0;

    for (j = 0; j < nData; j++) {
        if (c[i] > c[j] && (i != j)) {
            c[j] = 0;
        } else if (i != j) {

            c[i] = 0;
            i = j;
        }
    }

    return *(pData + i);
}

void anemometroCalibCero(void) {
    float ceroMed[N_TIMER_MODE];
    uint8_t i = 0, j = 0;
    float ceroMode[4];

    for (j = 0; j < 4; j++) {
        for (i = 0; i < N_TIMER_MODE; i++) {

            ceroMed[i] = anemometroGetCoordTime((mux_transSelect_enum) j);
            vTaskDelay(10 / portTICK_PERIOD_MS);
        }
        ceroMode[j] = anemometroCalcMode(ceroMed, N_TIMER_MODE);
    }
    detect_delta_O = ceroMode[0] - DISTANCE_EO / SOUND_SPEED;
    detect_delta_E = ceroMode[1] - DISTANCE_EO / SOUND_SPEED;
    detect_delta_N = ceroMode[2] - DISTANCE_NS / SOUND_SPEED;
    detect_delta_S = ceroMode[3] - DISTANCE_NS / SOUND_SPEED;
}

